doc/api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-08 Sun 11:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Baoqu REST API</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Miguel de la Cruz &lt;mgdelacroix@gmail.com&gt;" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Baoqu REST API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6299230">1. Root</a>
<ul>
<li><a href="#orgc649839">1.1. <code>GET /sse</code></a></li>
<li><a href="#org1219b2a">1.2. <code>GET /api</code></a></li>
</ul>
</li>
<li><a href="#org509e1a7">2. Login</a>
<ul>
<li><a href="#org4c52801">2.1. <code>POST /login</code></a></li>
</ul>
</li>
<li><a href="#org135d5ea">3. Users</a>
<ul>
<li><a href="#orgd12ee9b">3.1. <code>GET /api/users/:user-id/path</code></a></li>
<li><a href="#org6113d09">3.2. <code>GET /api/user-circle/:user-id</code></a></li>
</ul>
</li>
<li><a href="#org3a171ce">4. Events</a>
<ul>
<li><a href="#orga96c490">4.1. <code>GET /api/events</code></a></li>
<li><a href="#orgde645af">4.2. <code>GET /api/events/:event-id</code></a></li>
<li><a href="#org8c20379">4.3. <code>GET /api/events/:event-id/circles</code></a></li>
<li><a href="#org4f0b4fd">4.4. <code>GET /api/events/:event-id/users</code></a></li>
<li><a href="#org6e3a97f">4.5. <code>POST /api/events/:event-id/users</code></a></li>
<li><a href="#org363f252">4.6. <code>GET /api/events/:event-id/ideas</code></a></li>
<li><a href="#org0179ede">4.7. <code>GET /api/events/:event-id/comments</code></a></li>
<li><a href="#org69b4eaf">4.8. <code>GET /api/events/:event-id/votes</code></a></li>
</ul>
</li>
<li><a href="#orgcaa26fe">5. Circles</a>
<ul>
<li><a href="#orgf54a1ea">5.1. <code>GET /api/circles/:circle-id/comments</code></a></li>
<li><a href="#orgd54cb3d">5.2. <code>POST /api/circles/:circle-id/comments</code></a></li>
<li><a href="#orgd843153">5.3. <code>GET /api/circles/:circle-id/ideas</code></a></li>
</ul>
</li>
<li><a href="#orgec75d7f">6. Ideas</a>
<ul>
<li><a href="#orgc968223">6.1. <code>POST /api/ideas/upvote</code></a></li>
<li><a href="#org650c160">6.2. <code>POST /api/ideas/downvote</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6299230" class="outline-2">
<h2 id="org6299230"><span class="section-number-2">1</span> Root</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc649839" class="outline-3">
<h3 id="orgc649839"><span class="section-number-3">1.1</span> <code>GET /sse</code></h3>
</div>

<div id="outline-container-org1219b2a" class="outline-3">
<h3 id="org1219b2a"><span class="section-number-3">1.2</span> <code>GET /api</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
This needs to change, from the "example" right now to a hash of the
application's last commit.
</p>
</div>
</div>
</div>

<div id="outline-container-org509e1a7" class="outline-2">
<h2 id="org509e1a7"><span class="section-number-2">2</span> Login</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4c52801" class="outline-3">
<h3 id="org4c52801"><span class="section-number-3">2.1</span> <code>POST /login</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Request:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">username</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The username to authenticate</td>
</tr>

<tr>
<td class="org-left">password</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The username's password</td>
</tr>
</tbody>
</table>

<p>
<b>Payload example:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"username"</span>: <span style="color: #97d8ea;">"myusername"</span>,
  <span style="color: #97d8ea;">"password"</span>: <span style="color: #97d8ea;">"mypassword"</span>
}
</pre>
</div>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"token"</span>: <span style="color: #97d8ea;">""</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org135d5ea" class="outline-2">
<h2 id="org135d5ea"><span class="section-number-2">3</span> Users</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd12ee9b" class="outline-3">
<h3 id="orgd12ee9b"><span class="section-number-3">3.1</span> <code>GET /api/users/:user-id/path</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Returns a list with the path of the circles of a user for an event.
</p>

<p>
<b>CHANGE:</b>
</p>

<p>
Should become <code>/api/events/:event-id/users/:user-id/path</code>
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[ 4, 1 ]
</pre>
</div>
</div>
</div>

<div id="outline-container-org6113d09" class="outline-3">
<h3 id="org6113d09"><span class="section-number-3">3.2</span> <code>GET /api/user-circle/:user-id</code></h3>
<div class="outline-text-3" id="text-3-2">
<p>
Returns the highest level circle for the current user in an event.
</p>

<p>
<b>CHANGE:</b>
</p>

<p>
Should become <code>/api/events/:event-id/users/:user-id/highest-circle</code>
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"id"</span>: 4,
  <span style="color: #97d8ea;">"event-id"</span>: 2,
  <span style="color: #97d8ea;">"level"</span>: 2,
  <span style="color: #97d8ea;">"size"</span>: 3,
  <span style="color: #97d8ea;">"parent-circle-id"</span>: <span style="color: #7fffd4;">null</span>,
  <span style="color: #97d8ea;">"user-id"</span>: 1,
  <span style="color: #97d8ea;">"circle-id"</span>: 4
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a171ce" class="outline-2">
<h2 id="org3a171ce"><span class="section-number-2">4</span> Events</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga96c490" class="outline-3">
<h3 id="orga96c490"><span class="section-number-3">4.1</span> <code>GET /api/events</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Returns a list of the platform's events.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Probando Baoqu"</span>,
    <span style="color: #97d8ea;">"description"</span>: <span style="color: #7fffd4;">null</span>,
    <span style="color: #97d8ea;">"circle-size"</span>: 3,
    <span style="color: #97d8ea;">"agreement-factor"</span>: 3
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 2,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Ciclismo en la Guindalera, una discusi&#243;n abierta"</span>,
    <span style="color: #97d8ea;">"description"</span>: <span style="color: #7fffd4;">null</span>,
    <span style="color: #97d8ea;">"circle-size"</span>: 3,
    <span style="color: #97d8ea;">"agreement-factor"</span>: 3
  }
]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde645af" class="outline-3">
<h3 id="orgde645af"><span class="section-number-3">4.2</span> <code>GET /api/events/:event-id</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Returns the details of an event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"id"</span>: 1,
  <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Probando Baoqu"</span>,
  <span style="color: #97d8ea;">"description"</span>: <span style="color: #7fffd4;">null</span>,
  <span style="color: #97d8ea;">"circle-size"</span>: 3,
  <span style="color: #97d8ea;">"agreement-factor"</span>: 3
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c20379" class="outline-3">
<h3 id="org8c20379"><span class="section-number-3">4.3</span> <code>GET /api/events/:event-id/circles</code></h3>
<div class="outline-text-3" id="text-4-3">
<p>
Get all circles of an event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"event-id"</span>: 2,
    <span style="color: #97d8ea;">"level"</span>: 1,
    <span style="color: #97d8ea;">"size"</span>: 3,
    <span style="color: #97d8ea;">"parent-circle-id"</span>: 4,
    <span style="color: #97d8ea;">"inner-circles"</span>: [],
    <span style="color: #97d8ea;">"users"</span>: [ 1, 3, 2 ]
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 2,
    <span style="color: #97d8ea;">"event-id"</span>: 2,
    <span style="color: #97d8ea;">"level"</span>: 1,
    <span style="color: #97d8ea;">"size"</span>: 3,
    <span style="color: #97d8ea;">"parent-circle-id"</span>: 4,
    <span style="color: #97d8ea;">"inner-circles"</span>: [],
    <span style="color: #97d8ea;">"users"</span>: [ 4, 6, 5 ]
  },

  ...

]
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f0b4fd" class="outline-3">
<h3 id="org4f0b4fd"><span class="section-number-3">4.4</span> <code>GET /api/events/:event-id/users</code></h3>
<div class="outline-text-3" id="text-4-4">
<p>
Get all users of an event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Ramira"</span>,
    <span style="color: #97d8ea;">"circles"</span>: [ 1, 4 ],
    <span style="color: #97d8ea;">"ideas"</span>: [ 1, 2 ]
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 2,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Maria"</span>,
    <span style="color: #97d8ea;">"circles"</span>: [ 1, 4 ],
    <span style="color: #97d8ea;">"ideas"</span>: [ 1, 2 ]
  },

  ...

]
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e3a97f" class="outline-3">
<h3 id="org6e3a97f"><span class="section-number-3">4.5</span> <code>POST /api/events/:event-id/users</code></h3>
<div class="outline-text-3" id="text-4-5">
<p>
Add a user to the event.
</p>

<p>
<b>Request:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The name of the user to add</td>
</tr>
</tbody>
</table>

<p>
<b>Payload example:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"NewUserName"</span>
}
</pre>
</div>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>

<div id="outline-container-org363f252" class="outline-3">
<h3 id="org363f252"><span class="section-number-3">4.6</span> <code>GET /api/events/:event-id/ideas</code></h3>
<div class="outline-text-3" id="text-4-6">
<p>
Get all ideas of the event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 4,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"C&#243;mo conectar con el centro: bulevar en Juan Bravo"</span>,
    <span style="color: #97d8ea;">"event-id"</span>: 2
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"En la d&#233;cima PIWEEK lo arreglamos todo"</span>,
    <span style="color: #97d8ea;">"event-id"</span>: 2
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 6,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Hay que arreglar los baches, son un peligro"</span>,
    <span style="color: #97d8ea;">"event-id"</span>: 2
  },

  ...

]
</pre>
</div>
</div>
</div>

<div id="outline-container-org0179ede" class="outline-3">
<h3 id="org0179ede"><span class="section-number-3">4.7</span> <code>GET /api/events/:event-id/comments</code></h3>
<div class="outline-text-3" id="text-4-7">
<p>
Get all comments of the event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"user-id"</span>: 7,
    <span style="color: #97d8ea;">"circle-id"</span>: 3,
    <span style="color: #97d8ea;">"body"</span>: <span style="color: #97d8ea;">"Hola bobos!"</span>,
    <span style="color: #97d8ea;">"date"</span>: 1507408043408,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Magikarp"</span>
  },

  ...

]
</pre>
</div>
</div>
</div>

<div id="outline-container-org69b4eaf" class="outline-3">
<h3 id="org69b4eaf"><span class="section-number-3">4.8</span> <code>GET /api/events/:event-id/votes</code></h3>
<div class="outline-text-3" id="text-4-8">
<p>
Get all the votes of the event.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"user-id"</span>: 1,
    <span style="color: #97d8ea;">"idea-id"</span>: 1
  },
  {
    <span style="color: #97d8ea;">"user-id"</span>: 2,
    <span style="color: #97d8ea;">"idea-id"</span>: 1
  },
  {
    <span style="color: #97d8ea;">"user-id"</span>: 3,
    <span style="color: #97d8ea;">"idea-id"</span>: 1
  },
  {
    <span style="color: #97d8ea;">"user-id"</span>: 4,
    <span style="color: #97d8ea;">"idea-id"</span>: 1
  },

  ...

]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcaa26fe" class="outline-2">
<h2 id="orgcaa26fe"><span class="section-number-2">5</span> Circles</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf54a1ea" class="outline-3">
<h3 id="orgf54a1ea"><span class="section-number-3">5.1</span> <code>GET /api/circles/:circle-id/comments</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
Get all comments of a circle.
</p>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"user-id"</span>: 7,
    <span style="color: #97d8ea;">"circle-id"</span>: 3,
    <span style="color: #97d8ea;">"body"</span>: <span style="color: #97d8ea;">"Hola bobos!"</span>,
    <span style="color: #97d8ea;">"date"</span>: 1507408043408,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Magikarp"</span>
  }
]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd54cb3d" class="outline-3">
<h3 id="orgd54cb3d"><span class="section-number-3">5.2</span> <code>POST /api/circles/:circle-id/comments</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Create a new comment in a circle.
</p>

<p>
<b>Request:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The name of the user that is creating the comment</td>
</tr>

<tr>
<td class="org-left">comment-body</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The body of the comment</td>
</tr>
</tbody>
</table>

<p>
<b>Payload example:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"MyUsername"</span>,
  <span style="color: #97d8ea;">"comment-body"</span>: <span style="color: #97d8ea;">"Hello all!"</span>
}
</pre>
</div>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd843153" class="outline-3">
<h3 id="orgd843153"><span class="section-number-3">5.3</span> <code>GET /api/circles/:circle-id/ideas</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
Get all ideas for a circle.
</p>

<div class="org-src-container">
<pre class="src src-js">[
  {
    <span style="color: #97d8ea;">"id"</span>: 1,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"En la d&#233;cima PIWEEK lo arreglamos todo"</span>,
    <span style="color: #97d8ea;">"votes"</span>: 1,
    <span style="color: #97d8ea;">"voted?"</span>: <span style="color: #7fffd4;">false</span>
  },
  {
    <span style="color: #97d8ea;">"id"</span>: 5,
    <span style="color: #97d8ea;">"name"</span>: <span style="color: #97d8ea;">"Sin presupuestos es dif&#237;cil hacer nada"</span>,
    <span style="color: #97d8ea;">"votes"</span>: 1,
    <span style="color: #97d8ea;">"voted?"</span>: <span style="color: #7fffd4;">false</span>
  }
]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgec75d7f" class="outline-2">
<h2 id="orgec75d7f"><span class="section-number-2">6</span> Ideas</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc968223" class="outline-3">
<h3 id="orgc968223"><span class="section-number-3">6.1</span> <code>POST /api/ideas/upvote</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
Upvote an idea.
</p>

<p>
<b>CHANGE:</b>
</p>

<p>
Should become: <code>/api/events/:event-id/ideas/upvote</code>
</p>

<p>
<b>Request:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">user-id</td>
<td class="org-left">integer</td>
<td class="org-left">yes</td>
<td class="org-left">ID of the user</td>
</tr>

<tr>
<td class="org-left">idea-name</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The body of the idea</td>
</tr>

<tr>
<td class="org-left">event-id</td>
<td class="org-left">integer</td>
<td class="org-left">yes</td>
<td class="org-left">ID of the event</td>
</tr>
</tbody>
</table>

<p>
<b>Payload example:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"user-id"</span>: 1,
  <span style="color: #97d8ea;">"idea-name"</span>: <span style="color: #97d8ea;">"My idea"</span>,
  <span style="color: #97d8ea;">"event-id"</span>: 3
}
</pre>
</div>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>

<div id="outline-container-org650c160" class="outline-3">
<h3 id="org650c160"><span class="section-number-3">6.2</span> <code>POST /api/ideas/downvote</code></h3>
<div class="outline-text-3" id="text-6-2">
<p>
Downvote an idea.
</p>

<p>
<b>CHANGE:</b>
</p>

<p>
Should become: <code>/api/events/:event-id/ideas/downvote</code>
</p>

<p>
<b>Request:</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">user-id</td>
<td class="org-left">integer</td>
<td class="org-left">yes</td>
<td class="org-left">ID of the user</td>
</tr>

<tr>
<td class="org-left">idea-name</td>
<td class="org-left">string</td>
<td class="org-left">yes</td>
<td class="org-left">The body of the idea</td>
</tr>

<tr>
<td class="org-left">event-id</td>
<td class="org-left">integer</td>
<td class="org-left">yes</td>
<td class="org-left">ID of the event</td>
</tr>
</tbody>
</table>

<p>
<b>Payload example:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #97d8ea;">"user-id"</span>: 1,
  <span style="color: #97d8ea;">"idea-name"</span>: <span style="color: #97d8ea;">"My idea"</span>,
  <span style="color: #97d8ea;">"event-id"</span>: 3
}
</pre>
</div>

<p>
<b>Response:</b>
</p>

<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Miguel de la Cruz &lt;mgdelacroix@gmail.com&gt;</p>
<p class="date">Created: 2017-10-08 Sun 11:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
